<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"fad1c31bbdec9901bde41834c9eef77cdadc64a9412eacc535fdd9fb08608b68","plan_job_ref":"Job Staging Image Build & Push #9 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343499067","plan_hash":"20eac6757b3d5b24f8beca84efa140f3c343681ffe57f15c8b91893eb357dc83","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 4 to add, 2 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:9" -> "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:10"
#        (16 unchanged attributes hidden)

-       load_balancer {
-           container_name   = "dev_FastAPI_image" -> null
-           container_port   = 5000 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group/7c49f2922395a2e5" -> null
        }
+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

!~      network_configuration {
!~          security_groups  = [
-               "sg-047016b150e4e9568",
            ] -> (known after apply)
#            (2 unchanged attributes hidden)
        }

#        (2 unchanged blocks hidden)
    }

  # aws_lb.alb will be updated in-place
!~  resource "aws_lb" "alb" {
        id                                          = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/de3ca46bf5618dde"
        name                                        = "fastapi-lb-dev"
!~      security_groups                             = [
-           "sg-09895e6a8deaf278b",
        ] -> (known after apply)
        tags                                        = {}
#        (21 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be created
+   resource "aws_lb_listener" "front_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/de3ca46bf5618dde"
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.target_group_P-5000 must be replaced
-/+ resource "aws_lb_target_group" "target_group_P-5000" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group/7c49f2922395a2e5" -> (known after apply)
!~      arn_suffix                         = "targetgroup/alb-target-group/7c49f2922395a2e5" -> (known after apply)
+       connection_termination             = (known after apply)
!~      id                                 = "****************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
!~      load_balancing_algorithm_type      = "round_robin" -> (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
!~      name                               = "alb-target-group" -> "alb-target-group-dev" # forces replacement
+       name_prefix                        = (known after apply)
+       preserve_client_ip                 = (known after apply)
!~      protocol_version                   = "HTTP1" -> (known after apply)
-       tags                               = {} -> null
#        (9 unchanged attributes hidden)

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTP" -> null
-           timeout             = 5 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 86400 -> null
-           enabled         = false -> null
-           type            = "lb_cookie" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

  # aws_security_group.ALB_to_containers must be replaced
-/+ resource "aws_security_group" "ALB_to_containers" {
!~      arn                    = "arn:aws:ec2:eu-central-1:806066816337:security-group/sg-047016b150e4e9568" -> (known after apply)
!~      id                     = "********************" -> (known after apply)
!~      ingress                = [
-           {
-               cidr_blocks      = []
-               description      = "Inbound ALB to ECS containers"
-               from_port        = 5000
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = [
-                   "sg-09895e6a8deaf278b",
                ]
-               self             = false
-               to_port          = 5000
            },
+           {
+               cidr_blocks      = []
+               description      = "Inbound ALB to ECS containers"
+               from_port        = 5000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 5000
            },
        ]
!~      name                   = "alb-to-containers" -> "alb-to-containers-dev" # forces replacement
+       name_prefix            = (known after apply)
!~      owner_id               = "************" -> (known after apply)
-       tags                   = {} -> null
!~      vpc_id                 = "*********************" -> (known after apply)
#        (4 unchanged attributes hidden)
    }

  # aws_security_group.internet_to_ALB must be replaced
-/+ resource "aws_security_group" "internet_to_ALB" {
!~      arn                    = "arn:aws:ec2:eu-central-1:806066816337:security-group/sg-09895e6a8deaf278b" -> (known after apply)
!~      id                     = "********************" -> (known after apply)
!~      name                   = "internet-to-alb" -> "internet-to-alb-dev" # forces replacement
+       name_prefix            = (known after apply)
!~      owner_id               = "************" -> (known after apply)
-       tags                   = {} -> null
!~      vpc_id                 = "*********************" -> (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #9](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343499067)